---
kind: enumMember
id: F:Autodesk.Revit.DB.PointOnCurveMeasurementType.NonNormalizedCurveParameter
enum: Autodesk.Revit.DB.PointOnCurveMeasurementType
source: html/8bd00c68-1bcd-9bc9-c246-0f0c96962146.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasurementType.NonNormalizedCurveParameter

The non-normalized (actual) curve parameter value of the given point.
 The curve parameter is the defining parameter of the curve.
 It is also known as the raw/natural parameter.